﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//
// @file  BmcLanConfigBoard.uni
//
//  String definitions for the BmcLanConfig
//

//#include "VFR.uni"
#langdef   en-US "English"    // English
#langdef   x-AMI "x-AMI"    // AMI Mapping Language

#string STR_NULL_STRING                  #language en-US ""

#string STR_BMC_NETWORK_TITLE            #language en-US "BMC network configuration"
#string STR_BMC_NETWORK_LIST             #language en-US "BMC network list"
#string STR_BMC_NETWORK_HELP             #language en-US "Configure BMC network parameters"
#string STR_LAN_OPTION_HELP              #language en-US "Select to configure LAN channel parameters statically or dynamically(by BIOS or BMC). Unspecified option will not modify any BMC network parameters during BIOS phase"
#string STR_CURR_LAN_OPTION_HELP         #language en-US "Current LAN Configuration statically or dynamically(by BIOS or BMC). Unspecified for not Configured address space"
#string STR_LAN_CHANNEL_1                #language en-US "Lan channel 1"
#string STR_LAN_CHANNEL_2                #language en-US "Lan channel 2"
#string STR_ETH_PORT1                    #language en-US "Bmc Ethernet Port 1"
#string STR_ETH_PORT2                    #language en-US "Bmc Ethernet Port 2"
#string STR_LAN_OPTION                   #language en-US "Configuration Address source"
                                         #language x-AMI "IPMI500"
#string STR_CURR_LAN_OPTION              #language en-US "Current Configuration Address source"
#string STR_STATION_IP_ADDRESS           #language en-US "Station IP address"
                                         #language x-AMI "IPMI501"
#string STR_STATION_IP_HELP              #language en-US "Enter station IP address"
#string STR_STATION_MAC_ADDRESS          #language en-US "Station MAC address"
#string STR_STATION_MAC_HELP             #language en-US "Enter station MAC address"
#string STR_SUBNET_MASK                  #language en-US "Subnet mask"
                                         #language x-AMI "IPMI502"
#string STR_SUBNET_MASK_HELP             #language en-US "Enter subnet mask"
#string STR_ROUTER_IP_ADDRESS            #language en-US "Router IP address"
                                         #language x-AMI "IPMI503"
#string STR_ROUTER_IP_HELP               #language en-US "Enter router IP address"
#string STR_ROUTER_MAC_ADDRESS           #language en-US "Router MAC address"
                                         #language x-AMI "IPMI504"
#string STR_ROUTER_MAC_HELP              #language en-US "Enter router MAC address"
#string STR_UNSPECIFIED                  #language en-US "Unspecified"
#string STR_BIOS_STATIC                  #language en-US "Static"
#string STR_BMC_DYNAMIC                  #language en-US "DynamicBmcDhcp"
#string STR_BMC_ADDR_PROTOCOL            #language en-US "DynamicBmcNonDhcp"

#string STR_CURR_LANCAS1_VAL             #language en-US  "-"
#string STR_CURR_LANCAS2_VAL             #language en-US  "-"
#string STR_STATION_IP1_VAL              #language en-US  "-"
#string STR_STATION_IP2_VAL              #language en-US  "-"
#string STR_BMC_STATION_IP_HELP          #language en-US  "Station IP address from BMC"
#string STR_STATION_MAC1_VAL             #language en-US  "-"
#string STR_STATION_MAC2_VAL             #language en-US  "-"
#string STR_BMC_STATION_MAC_ADDRESS      #language en-US  "Station MAC address from BMC"
#string STR_SUBNET_MASK1_VAL             #language en-US  "-"
#string STR_SUBNET_MASK2_VAL             #language en-US  "-"
#string STR_BMC_SUBNET_MASK_HELP         #language en-US  "Subnet mask from BMC"
#string STR_ROUTER_IP1_VAL               #language en-US  "-"
#string STR_ROUTER_IP2_VAL               #language en-US  "-"
#string STR_BMC_ROUTER_IP_HELP           #language en-US  "Router IP address from BMC"
#string STR_ROUTER_MAC1_VAL              #language en-US  "-"
#string STR_ROUTER_MAC2_VAL              #language en-US  "-"
#string STR_BMC_ROUTER_MAC_HELP          #language en-US  "Router MAC address from BMC"


#string STR_INVALID_STATION_IP                       #language en-US "Invalid Station Ip Entered!!!"
#string STR_INVALID_SUBNETMASK                       #language en-US "Invalid Subnet Mask Entered!!!"
#string STR_INVALID_ROUTER_IP                        #language en-US "Invalid Router Ip Entered!!!"
#string STR_INVALID_ROUTER_MAC                       #language en-US "Invalid Router MAC Entered!!!"
#string STR_BMCLAN_ERROR_INFO                        #language en-US "BMC LAN ERROR INFO"
#string STR_IPSOURCE_STATIC_ADDRESS                  #language en-US "StaticAddress"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_DHCP        #language en-US "DynamicAddressBmcDhcp"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BIOS_DHCP       #language en-US "DynamicAddressBiosDhcp"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_NON_DHCP    #language en-US "DynamicAddressBmcNonDhcp"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093     **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
